src_Extension/DataProcessors/ФоноваяГрупповая.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ФоноваяГрупповая</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДопРеквизит</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src_Extension/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Номенклатура</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмеренияТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_Extension/DataProcessors/ФоноваяГрупповая/Ext/ManagerModule.bsl
Процедура ОчиститьВсеФоново(ДопРеквизит) Экспорт
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НоменклатураДополнительныеРеквизиты.Ссылка) КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|ГДЕ
		|	НоменклатураДополнительныеРеквизиты.Свойство = &Свойство");
	Запрос.УстановитьПараметр("Свойство", ДопРеквизит);
	Выб = Запрос.Выполнить().Выбрать();                             
	Выб.Следующий();
	КолЗаписей = Выб.Ссылка;
	ПроцентВыполнения = 0; 
	ПроцентВыполненияБыл = 0; 
	НомерЗаписи = 0;       
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 400
		|	НоменклатураДополнительныеРеквизиты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|ГДЕ
		|	НоменклатураДополнительныеРеквизиты.Свойство = &Свойство";
	Выб = Запрос.Выполнить().Выбрать();                             
	Пока Выб.Количество()>0 цикл
		Пока Выб.Следующий() цикл
			Элем = Выб.Ссылка.ПолучитьОбъект(); 
			Стр = Элем.ДополнительныеРеквизиты.Найти(ДопРеквизит,"Свойство");
			Если Стр <> Неопределено тогда
				Элем.ДополнительныеРеквизиты.Удалить(Стр);
			КонецЕсли; 
			Если Элем.Модифицированность() тогда
				Элем.Записать();
			КонецЕсли;
			НомерЗаписи = НомерЗаписи + 1;
			ПроцентВыполнения = Цел(100*НомерЗаписи/КолЗаписей);
			Если ПроцентВыполнения <> ПроцентВыполненияБыл тогда
				ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения);
	            ПроцентВыполненияБыл = ПроцентВыполнения;
			КонецЕсли;
		КонецЦикла;
		Выб = Запрос.Выполнить().Выбрать();
	КонецЦикла;
КонецПроцедуры
